README.org
#+TITLE:      chopepi
#+AUTHOR:     Francisco Viciana
#+EMAIL:      viciana  AT us DOT es
#+LANGUAGE:   es
#+OPTIONS: ^:nil
#+BABEL: :session *R* :cache yes :results output graphics :exports both :tangle yes 

* chopepi: Trocear episodios en multiples escalas de tiempo

