README.md


# chopepi: Trocear episodios en multiples escalas de tiempo
