README.org
** Motivación 

En estudios longitudinales de seguimiento es habitual enfrentarse al
problema de tener que analizar efectos temporales en *múltiples
escalas de tiempo*, tales como la edad, el tiempo calendario o la
duración desde un evento anterior. En situaciones donde no sea
asumible la linealidad de los efectos temporales o cuando se precise
estudiar interrelaciones suele ser preciso discretizar los tiempos de
exposición de las escalas temporales. Esta tarea suele implicar
relativamente costosas manipulaciones del "dataset original" de
acuerdo a prepararlo para las especificaciones del modelo que queremos
ajustar.

Los *dataset* crudos habitualmente están compuesto por secuencias
ordenadas de *episodios* independientes. Cada individuo en seguimiento
tendrá una secuencia de uno o más episodios, que recoge su trayectoria
en el *espacio de estados* que hemos definido durante la *ventana de
observación* que estemos analizando.

Los episodios, tienen fecha de comienzo y terminación y su correspondiente
estado al comienzo (*Current Status: Cst*) y a su finalización (*Exit
Status: Xst*). En la siguiente tabla se muestra un ejemplo de un
sencillo "dataset", con dos escalas de tiempo explicitas: tiempo
calendario y edad. En ella se representa las biografías reproductivas de
tres individuos ("ikey") resumida en 7 episodios de paridad ("ikey" +
"seq.epi" ~ "kepi"). Donde "date.star" es la fecha calendario del
evento, "age.entry" la edad exacta en años decimales al comienzo del
episodio; "span.years" y "span.days" son las duracione del episodio en
unidades dias y años; "Cst.par" la paridad al comienzo del episodio y
"Xst.par" la paridad al terminar el episodio. En esta tabla hay
redundancia, ya que varias de las variable pueden ser derivadas, por
manipulación o transformaciones de alguna de las otras variables y no
seria necesarias en una tabla de datos optimizada. Por motivos
de claridad se prefiere mantenerlas.

#+CAPTION: Original data
#+NAME: tbl:original
| ikey | seq.epi | kepi | date.start | age.entry | span.years | span.days | Cst.par | Xst.par |
|------+---------+------+------------+-----------+------------+-----------+---------+---------|
|    1 |       1 |  101 | 1958-03-13 |     0.000 |     23.169 |      8463 |       0 |       1 |
|    1 |       2 |  102 | 1981-05-14 |    23.169 |      3.635 |      1328 |       1 |       1 |
|    2 |       1 |  201 | 1955-07-10 |     0.000 |     21.079 |      7699 |       0 |       1 |
|    2 |       2 |  202 | 1976-08-07 |    21.079 |      4.808 |      1757 |       1 |       2 |
|    2 |       3 |  203 | 1981-05-30 |    25.887 |      3.591 |      1312 |       2 |       3 |
|    3 |       1 |  301 | 1960-02-29 |     0.000 |     18.997 |      6939 |       0 |       1 |
|    3 |       2 |  302 | 1979-02-28 |    18.997 |      5.841 |      2134 |       1 |       1 |


Una de las manipulaciones habituales que hay que enfrentar al analizar
datos longitudinales es el particionado (también denominados
discretización o "split") de las escalas de tiempo a analizar. Por
ejemplo si queremos estudiar efectos no lineales de la edad sobre la
ampliación de la paridad, podríamos discretizar la variable edad, en
agrupaciones quinquenales, para comprobar los distintos efectos en
intensidad de fecundidad en cada uno de los grupo de edad. Para ello
seria preciso transformar la tabla anterior en otra donde cada
episodios de paridad (sin hijos, con un hijo, ..), se dividirá en
varios sub-episodios de acuerdo al tramo de edad de exposición en cada
intervalo de exposición por grupo de edad. En la siguiente tabla, se
muestra el resultado de particionar la escala de tiempo edad en grupos
de edad.


#+CAPTION: Split by age
#+NAME: tbl:Split.age
| kid |    age | duration | band.age | Cst | Xst |
|-----+--------+----------+----------+-----+-----|
| 101 |  0.000 |   15.000 | [0,15)   |   0 |   0 |
| 101 | 15.000 |    5.000 | [15,20)  |   0 |   0 |
| 101 | 20.000 |    3.169 | [20,25)  |   0 |   1 |
| 102 | 23.169 |    1.831 | [20,25)  |   1 |   1 |
| 102 | 25.000 |    1.804 | [25,30)  |   1 |   1 |
| 201 |  0.000 |   15.000 | [0,15)   |   0 |   0 |
| 201 | 15.000 |    5.000 | [15,20)  |   0 |   0 |
| 201 | 20.000 |    1.079 | [20,25)  |   0 |   1 |
| 202 | 21.079 |    3.921 | [20,25)  |   1 |   1 |
| 202 | 25.000 |    0.887 | [25,30)  |   1 |   2 |
| 203 | 25.887 |    3.591 | [25,30)  |   2 |   3 |
| 301 |  0.000 |   15.000 | [0,15)   |   0 |   0 |
| 301 | 15.000 |    3.997 | [15,20)  |   0 |   1 |
| 302 | 18.997 |    1.003 | [15,20)  |   1 |   1 |
| 302 | 20.000 |    4.838 | [20,25)  |   1 |   1 |


Igual que subdividimos los episodio en la escala de edad, podríamos
subdividirlos tambien en la escala de tiempo calendario. particionado
que  quedaría de esta manera:

#+CAPTION: Split by period
#+NAME: tbl:Split.period
| kid |   period | duration | band.period | Cst | Xst |
|-----+----------+----------+-------------+-----+-----|
| 101 | 1958.194 |   16.806 | [1950,1975) |   0 |   0 |
| 101 | 1975.000 |    5.000 | [1975,1980) |   0 |   0 |
| 101 | 1980.000 |    1.363 | [1980,1985) |   0 |   1 |
| 102 | 1981.364 |    3.635 | [1980,1985) |   1 |   1 |
| 201 | 1955.520 |   19.480 | [1950,1975) |   0 |   0 |
| 201 | 1975.000 |    1.599 | [1975,1980) |   0 |   1 |
| 202 | 1976.598 |    3.402 | [1975,1980) |   1 |   1 |
| 202 | 1980.000 |    1.406 | [1980,1985) |   1 |   2 |
| 203 | 1981.408 |    3.591 | [1980,1985) |   2 |   3 |
| 301 | 1960.161 |   14.839 | [1950,1975) |   0 |   0 |
| 301 | 1975.000 |    4.158 | [1975,1980) |   0 |   1 |
| 302 | 1979.158 |    0.842 | [1975,1980) |   1 |   1 |
| 302 | 1980.000 |    4.999 | [1980,1985) |   1 |   1 |


Es posible combinar esta dos particiones en dos escalas temporales
distinta, para obtener una sola partición multi-escala, tal como se
muestra en la siguiente tabla:

#+CAPTION: Split by age and period
#+NAME:   tbl:Split.age.period
| kid |    age |   period | duration | band.age | band.period | Cst | Xst |
|-----+--------+----------+----------+----------+-------------+-----+-----|
| 101 |  0.000 | 1958.194 |   15.000 | [0,15)   | [1950,1975) |   0 |   0 |
| 101 | 15.000 | 1973.194 |    1.806 | [15,20)  | [1950,1975) |   0 |   0 |
| 101 | 16.806 | 1975.000 |    3.194 | [15,20)  | [1975,1980) |   0 |   0 |
| 101 | 20.000 | 1978.194 |    1.806 | [20,25)  | [1975,1980) |   0 |   0 |
| 101 | 21.806 | 1980.000 |    1.363 | [20,25)  | [1980,1985) |   0 |   1 |
| 102 | 23.169 | 1981.364 |    1.831 | [20,25)  | [1980,1985) |   1 |   1 |
| 102 | 25.000 | 1983.195 |    1.804 | [25,30)  | [1980,1985) |   1 |   1 |
|  .. |        |          |          |          |             |     |     |
| 301 |  0.000 | 1960.161 |   14.839 | [0,15)   | [1950,1975) |   0 |   0 |
| 301 | 14.839 | 1975.000 |    0.161 | [0,15)   | [1975,1980) |   0 |   0 |
| 301 | 15.000 | 1975.161 |    3.997 | [15,20)  | [1975,1980) |   0 |   1 |
| 302 | 18.997 | 1979.158 |    0.842 | [15,20)  | [1975,1980) |   1 |   1 |
| 302 | 19.839 | 1980.000 |    0.161 | [15,20)  | [1980,1985) |   1 |   1 |
| 302 | 20.000 | 1980.161 |    4.838 | [20,25)  | [1980,1985) |   1 |   1 |

