README.md


<a id="org183f174"></a>

## Motivación

En estudios longitudinales de seguimiento es habitual enfrentarse al
problema de tener que analizar efectos temporales en **múltiples
escalas de tiempo**, tales como la edad, el tiempo calendario o la
duración desde un evento anterior. En situaciones donde no sea
asumible la linealidad de los efectos temporales o cuando se precise
estudiar interrelaciones suele ser preciso discretizar los tiempos de
exposición de las escalas temporales. Esta tarea suele implicar
relativamente costosas manipulaciones del "dataset original" de
acuerdo a prepararlo para las especificaciones del modelo que queremos
ajustar.

Los **dataset** crudos habitualmente están compuesto por secuencias
ordenadas de **episodios** independientes. Cada individuo en seguimiento
tendrá una secuencia de uno o más episodios, que recoge su trayectoria
en el **espacio de estados** que hemos definido durante la **ventana de
observación** que estemos analizando.

Los episodios, tienen fecha de comienzo y terminación y su correspondiente
estado al comienzo (**Current Status: Cst**) y a su finalización (**Exit
Status: Xst**). En la siguiente tabla se muestra un ejemplo de un
sencillo "dataset", con dos escalas de tiempo explicitas: tiempo
calendario y edad. En ella se representa las biografías reproductivas de
tres individuos ("ikey") resumida en 7 episodios de paridad ("ikey" +
"seq.epi" ~ "kepi"). Donde "date.star" es la fecha calendario del
evento, "age.entry" la edad exacta en años decimales al comienzo del
episodio; "span.years" y "span.days" son las duracione del episodio en
unidades dias y años; "Cst.par" la paridad al comienzo del episodio y
"Xst.par" la paridad al terminar el episodio. En esta tabla hay
redundancia, ya que varias de las variable pueden ser derivadas, por
manipulación o transformaciones de alguna de las otras variables y no
seria necesarias en una tabla de datos optimizada. Por motivos
de claridad se prefiere mantenerlas.

<table id="org088368b" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabla 1</span> Original data</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ikey</th>
<th scope="col" class="org-right">seq.epi</th>
<th scope="col" class="org-right">kepi</th>
<th scope="col" class="org-right">date.start</th>
<th scope="col" class="org-right">age.entry</th>
<th scope="col" class="org-right">span.years</th>
<th scope="col" class="org-right">span.days</th>
<th scope="col" class="org-right">Cst.par</th>
<th scope="col" class="org-right">Xst.par</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">101</td>
<td class="org-right">1958-03-13</td>
<td class="org-right">0.000</td>
<td class="org-right">23.169</td>
<td class="org-right">8463</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">102</td>
<td class="org-right">1981-05-14</td>
<td class="org-right">23.169</td>
<td class="org-right">3.635</td>
<td class="org-right">1328</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">201</td>
<td class="org-right">1955-07-10</td>
<td class="org-right">0.000</td>
<td class="org-right">21.079</td>
<td class="org-right">7699</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">202</td>
<td class="org-right">1976-08-07</td>
<td class="org-right">21.079</td>
<td class="org-right">4.808</td>
<td class="org-right">1757</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">203</td>
<td class="org-right">1981-05-30</td>
<td class="org-right">25.887</td>
<td class="org-right">3.591</td>
<td class="org-right">1312</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-right">1</td>
<td class="org-right">301</td>
<td class="org-right">1960-02-29</td>
<td class="org-right">0.000</td>
<td class="org-right">18.997</td>
<td class="org-right">6939</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">302</td>
<td class="org-right">1979-02-28</td>
<td class="org-right">18.997</td>
<td class="org-right">5.841</td>
<td class="org-right">2134</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

Una de las manipulaciones habituales que hay que enfrentar al analizar
datos longitudinales es el particionado (también denominados
discretización o "split") de las escalas de tiempo a analizar. Por
ejemplo si queremos estudiar efectos no lineales de la edad sobre la
ampliación de la paridad, podríamos discretizar la variable edad, en
agrupaciones quinquenales, para comprobar los distintos efectos en
intensidad de fecundidad en cada uno de los grupo de edad. Para ello
seria preciso transformar la tabla anterior en otra donde cada
episodios de paridad (sin hijos, con un hijo, ..), se dividirá en
varios sub-episodios de acuerdo al tramo de edad de exposición en cada
intervalo de exposición por grupo de edad. En la siguiente tabla, se
muestra el resultado de particionar la escala de tiempo edad en grupos
de edad.

<table id="org0f21682" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabla 2</span> Split by age</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">kid</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-right">duration</th>
<th scope="col" class="org-left">band.age</th>
<th scope="col" class="org-right">Cst</th>
<th scope="col" class="org-right">Xst</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">101</td>
<td class="org-right">0.000</td>
<td class="org-right">15.000</td>
<td class="org-left">[0,15)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">101</td>
<td class="org-right">15.000</td>
<td class="org-right">5.000</td>
<td class="org-left">[15,20)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">101</td>
<td class="org-right">20.000</td>
<td class="org-right">3.169</td>
<td class="org-left">[20,25)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">102</td>
<td class="org-right">23.169</td>
<td class="org-right">1.831</td>
<td class="org-left">[20,25)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">102</td>
<td class="org-right">25.000</td>
<td class="org-right">1.804</td>
<td class="org-left">[25,30)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">201</td>
<td class="org-right">0.000</td>
<td class="org-right">15.000</td>
<td class="org-left">[0,15)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">201</td>
<td class="org-right">15.000</td>
<td class="org-right">5.000</td>
<td class="org-left">[15,20)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">201</td>
<td class="org-right">20.000</td>
<td class="org-right">1.079</td>
<td class="org-left">[20,25)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">202</td>
<td class="org-right">21.079</td>
<td class="org-right">3.921</td>
<td class="org-left">[20,25)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">202</td>
<td class="org-right">25.000</td>
<td class="org-right">0.887</td>
<td class="org-left">[25,30)</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
</tr>


<tr>
<td class="org-right">203</td>
<td class="org-right">25.887</td>
<td class="org-right">3.591</td>
<td class="org-left">[25,30)</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">0.000</td>
<td class="org-right">15.000</td>
<td class="org-left">[0,15)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">15.000</td>
<td class="org-right">3.997</td>
<td class="org-left">[15,20)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">18.997</td>
<td class="org-right">1.003</td>
<td class="org-left">[15,20)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">20.000</td>
<td class="org-right">4.838</td>
<td class="org-left">[20,25)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

Igual que subdividimos los episodio en la escala de edad, podríamos
subdividirlos tambien en la escala de tiempo calendario. particionado
que  quedaría de esta manera:

<table id="org64ab999" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabla 3</span> Split by period</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">kid</th>
<th scope="col" class="org-right">period</th>
<th scope="col" class="org-right">duration</th>
<th scope="col" class="org-left">band.period</th>
<th scope="col" class="org-right">Cst</th>
<th scope="col" class="org-right">Xst</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">101</td>
<td class="org-right">1958.194</td>
<td class="org-right">16.806</td>
<td class="org-left">[1950,1975)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">101</td>
<td class="org-right">1975.000</td>
<td class="org-right">5.000</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">101</td>
<td class="org-right">1980.000</td>
<td class="org-right">1.363</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">102</td>
<td class="org-right">1981.364</td>
<td class="org-right">3.635</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">201</td>
<td class="org-right">1955.520</td>
<td class="org-right">19.480</td>
<td class="org-left">[1950,1975)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">201</td>
<td class="org-right">1975.000</td>
<td class="org-right">1.599</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">202</td>
<td class="org-right">1976.598</td>
<td class="org-right">3.402</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">202</td>
<td class="org-right">1980.000</td>
<td class="org-right">1.406</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
</tr>


<tr>
<td class="org-right">203</td>
<td class="org-right">1981.408</td>
<td class="org-right">3.591</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">1960.161</td>
<td class="org-right">14.839</td>
<td class="org-left">[1950,1975)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">1975.000</td>
<td class="org-right">4.158</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">1979.158</td>
<td class="org-right">0.842</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">1980.000</td>
<td class="org-right">4.999</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

Es posible combinar esta dos particiones en dos escalas temporales
distinta, para obtener una sola partición multi-escala, tal como se
muestra en la siguiente tabla:

<table id="org241a805" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabla 4</span> Split by age and period</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">kid</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-right">period</th>
<th scope="col" class="org-right">duration</th>
<th scope="col" class="org-left">band.age</th>
<th scope="col" class="org-left">band.period</th>
<th scope="col" class="org-right">Cst</th>
<th scope="col" class="org-right">Xst</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">101</td>
<td class="org-right">0.000</td>
<td class="org-right">1958.194</td>
<td class="org-right">15.000</td>
<td class="org-left">[0,15)</td>
<td class="org-left">[1950,1975)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">101</td>
<td class="org-right">15.000</td>
<td class="org-right">1973.194</td>
<td class="org-right">1.806</td>
<td class="org-left">[15,20)</td>
<td class="org-left">[1950,1975)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">101</td>
<td class="org-right">16.806</td>
<td class="org-right">1975.000</td>
<td class="org-right">3.194</td>
<td class="org-left">[15,20)</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">101</td>
<td class="org-right">20.000</td>
<td class="org-right">1978.194</td>
<td class="org-right">1.806</td>
<td class="org-left">[20,25)</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">101</td>
<td class="org-right">21.806</td>
<td class="org-right">1980.000</td>
<td class="org-right">1.363</td>
<td class="org-left">[20,25)</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">102</td>
<td class="org-right">23.169</td>
<td class="org-right">1981.364</td>
<td class="org-right">1.831</td>
<td class="org-left">[20,25)</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">102</td>
<td class="org-right">25.000</td>
<td class="org-right">1983.195</td>
<td class="org-right">1.804</td>
<td class="org-left">[25,30)</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">..</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">0.000</td>
<td class="org-right">1960.161</td>
<td class="org-right">14.839</td>
<td class="org-left">[0,15)</td>
<td class="org-left">[1950,1975)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">14.839</td>
<td class="org-right">1975.000</td>
<td class="org-right">0.161</td>
<td class="org-left">[0,15)</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">15.000</td>
<td class="org-right">1975.161</td>
<td class="org-right">3.997</td>
<td class="org-left">[15,20)</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">18.997</td>
<td class="org-right">1979.158</td>
<td class="org-right">0.842</td>
<td class="org-left">[15,20)</td>
<td class="org-left">[1975,1980)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">19.839</td>
<td class="org-right">1980.000</td>
<td class="org-right">0.161</td>
<td class="org-left">[15,20)</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">20.000</td>
<td class="org-right">1980.161</td>
<td class="org-right">4.838</td>
<td class="org-left">[20,25)</td>
<td class="org-left">[1980,1985)</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
