README.org
** Herramientas  para el particionado de episodios 

Varios paquetes de [[https://cran.r-project.org/web/views/Survival.html][R empleados en el análisis de supervivencia]] tienen
funciones especificamente diseñadas para realizar el particionado de
los episodios en una dimesiónm temporal. Algunos de estas funciones
son, por ejemplom [[https://www.rdocumentation.org/packages/survival/versions/3.1-8/topics/survSplit][survival::SurvSplit]], [[https://rdrr.io/cran/relsurv/man/survsplit.html][relsurv::survsplit]] o
[[https://www.rdocumentation.org/packages/Epi/versions/2.40/topics/splitLexis][Epi::splitLexis]]. Todas ellas hacen el particionado sobre una sola
escalan temporal, sin embargo aplicando sucesivamente estas funciones sobre
los sub-episodios resultado de ls partición con anterioridad, es posible
generar particiones en múltiples escalas temporales. Estas funciones
son sencillas de utilizar y eficientes cuando se trabaja con un número
no excesivamente grande de episodios y se dispone de suficientes
recursos de memoria RAM.

Desafortunadamente cuando el número de episodios que hay que
particionar crece, acercándose peligrosamente a los recurso de memoria
RAM del equipo, el rendimiento de estas funciones es pobre. Hay que
tener en cuenta que el crecimiento del número de episodio por encima
del óptimo, puede ocurrir incluso trabajando con tabla de episodios de
moderado tamaño, pero sobre las que precisemos realizar particionar en
múltiples escalas de tiempo (edades, tiempo calendario, duraciones
desde un episodio anterior ...)

El paquete *chopepi* que estamos desarrollando pretende mejora el
rendimiento de estos procesos, cuando no enfrentamos a tablas de
episodios de medio o gran tamaño. Para conseguir esta mejora aplicamos
dos estrategias: (1) por un lado usa objetos de tipo /data.table/ para
procesar los episodios, más rápidamente y eficientemente que con las
habituales tablas del tipo data.frame; y por otro (2) los
particionados en una escala temporal son pre-tratado en forma de
listas en lugar de tabla de sup-episodios lo cual es más sencillo y
rapido de generar y menos oneroso en cuanto a uso de la memoria de
trabajo.

La primera estrategia, trabajar con objetos del tipo
/data.table/, resulta mucho mas eficiente, en lugar de los
tradicionales /data.frame/ y sus derivados (Lexis, tibble ...), en
cuanto al uso de memoria RAM y velocidad de proceso, cuando se procesa
objeto de medio y gran tamaño. Si bien el uso del direccionamiento por
referencia de data.table crear algo de confusión en usuarios
poco habituados a trabajar con ello,  este inconvenientes es
rápidamente soluciónale, en cuanto se va adquiriendo cierta
experiencia en su manejo.

Esta misma estrategia de, usar /data.tabla/ es empleada por el paquete
[[https://github.com/WetRobot/popEpi][popEpi]] para mejorar el rendimiento de procesar los objetos del tipo
[[https://rdrr.io/cran/Epi/man/Lexis.html][Lexis]] definidos que define el paquete [[https://rdrr.io/cran/Epi/][Epi de Bendix Carstensen]] como
data.frame clasicos.

La segunda estrategia que utiliza el paquete *chopepi* es generar el
particionado de las escalas temporales sobre una lista de vectores de
igual tamaño que el número de episodios a procesar. Esta estrategia
por un lado mejora significativamente la velocidad de particionado
uni-escal y además, en caso de tener que trabajar con particionados en
multiples escalas reduce la complejidad del problema, ya que el número de
episodios a procesar  no crece multiplicativamente, si no solo
linealmente con la inclusión de nuevas escalas. 
  
El objetivo final del particionado uni o multi-escala es construir una
nueva tabla de sub-episodios cuyo tamaño sera el resultado de
multiplicar el tamaño de la tabla original por el número de medio
sub-episodios que cada escala de partición genera, tal como se ha
mostrado anteriormente la tabla "[[tbl:Split.age.period][Split by age and period]]". El paquete
*choopepi* divide el proceso de particionado en varios sub-procesos
intermedios que realizan cuatro funciones: /choop()/, /combine2()/,
/meltEpi()/ y /addCXst()/ y cuyos resultados intermedios se procesan
sucesivamente hasta obtener el resultado buscado.

Dado que una de las partes mas más costosos en memoria y tiempo de
proceso es la generación de multiples registros de subepisodios por
cada uno de los episodios originales partida, y su coste crece mas que
linealmente cuando aumenta el número de episodios, no es recomendable
obtener particionados multiescala a partir de la aplicación sucesivas,
de funciones del tipo /survSplit()/. Resulta menos oneroso en memoria
y tiempo de proceso realizar particiones unidimensionales
independientes de cada escala temporal para combinarlas
posteriormente. Este es una de las estrategia de optimización que usa
*chopepi* usar una combinación de funciones, en lugar de una única
función para conseguir su particionado.  La más importante de estas
funciones es *chop()*, la cual realiza un pre-particionado en una
escala subdivisión de la duración cada episodio sobre un vector con la
sucesión de tiempos de ocupación en cada categoría discreta de la
escala que estemos procesando (grupos de edad, años calendario ..), la
cual se almacenará en forma de lista de vectores en una columna una
tabla auxiliar con los resultados intermedios de la
pre-particionada. A modo de ejemplo, un pre-particionar en la escala
de edad de la [[tbl:original][tabla de episodios original]] produciría este resultado
intermedio:

#+CAPTION: Chop: duration by age
#+NAME:   tbl:Chop.age
| kid |    age | durations.age   |
|-----+--------+-----------------|
|  <> |     <> | <>              |
| 101 |  0.000 | c(15, 5, 3.169) |
| 102 | 23.169 | c(1.831, 1.804) |
| 201 |  0.000 | c(15, 5, 1.079) |
| 202 | 21.079 | c(3.921, 0.887) |
| 203 | 25.887 | 3.591           |
| 301 |  0.000 | c(15, 3.997)    |
| 302 | 18.997 | c(1.003, 4.838) |

Esta tabla intermedia de episodios preparticionado se puede convertir
en una tabla de sub-episodios individuales, por medio de dos funciones
/chopepi::meltEpi/ y /chopepi::addCXst/, que aplicadas secuencialmente
producen una tabla, donde cada sub-episodios es una fila, tal como se
muestra en la tabla anterior [[tbl:Chop.age]["Split by age"]]. Esta tabla podría volver
a sub-particionar aplicando de nuevo /chop()/ sobre otra escala
temporal. Pero, como se ha comentado, para obtener un particionado en
múltiples escala, esta estrategia no es eficiente, ya que el primer
particionado multiplica los episodios originales por el número de
particiones por episodio de la segunda escala de tiempo empleada, lo
que puede incrementar su número lo suficiente para reducir
significativamente el rendimiento del segundo particionado. Resulta
más adecuado pre-particionar con /chop()/ los episodios originales
sobre todas las escalas temporales a estudiar y tras ello combinar
estos en una nueva pre-partición multi-escala, a partir de la que
derivar posteriomente la tabla de subepisodios definitiva. Con esta
estrategia la complejidad del proceso crece linealmente por cada nueva
partición agregada en lugar de hacerlo multiplicativamete sin
aplicáramos el particionado secuencial.

Por ejemplo para conseguir una particionado múltiple en la escala edad
y calendario, aplicaremos /chop()/ de nuevo sobre los episodios
originales para obtener este 2º preparticionado:

#+CAPTION: Chop: duration by period
#+NAME:   tbl:Chop.period
| kid |   period | durations.period    |
|-----+----------+---------------------|
| 101 | 1958.194 | c(16.806, 5, 1.363) |
| 102 | 1981.364 | 3.634               |
| 201 | 1955.520 | c(19.48, 1.599)     |
| 202 | 1976.598 | c(3.402, 1.405)     |
| 203 | 1981.408 | 3.590               |
| 301 | 1960.161 | c(14.839, 4.158)    |
| 302 | 1979.158 | c(0.842, 4.999)     |

Para a continuación obtener el particionado en las dos escala de
tiempo combinamos los dos particionados unidimensionales en un nuevo
particionado multidimensional usando la función /combine2c/ sobre las
tablas pre-particionadas: "[[tbl:Chop.age][by age]]" y "[[tbl:Chop.period][by period]]", lo que producirá
el siguiente  resultado:

#+CAPTION: Chop: duration by age and period
#+NAME:   tbl:Chop.age.period
| kid |    age |   period | durations.age.period      |
|-----+--------+----------+---------------------------|
| 101 |  0.000 | 1958.194 | c(15, 1.8, 3.2, 1.8, 1.4) |
| 102 | 23.169 | 1981.364 | c(1.831, 1.8)             |
| 201 |  0.000 | 1955.520 | c(15, 4.5, 0.5, 1.1)      |
| 202 | 21.079 | 1976.598 | c(3.402, 0.5, 0.9)        |
| 203 | 25.887 | 1981.408 | 3.599                     |
| 301 |  0.000 | 1960.161 | c(14.839, 0.199, 4)       |
| 302 | 18.997 | 1979.158 | c(0.842, 0.2, 4.8)        |

A partir de esta tabla de pre-particionado multidimensional, mediante
la posterior aplicación de las funciones /meltEpi()/ y /addCXst()/ se
optiene una tabla con registros individuales por cada sub-episodios,
como la mostrada individuales "[[tbl:Split.age.period][Split by age and period]]" mostrada
anteriormente y que representa el objetivo finalmente buscado.

