README.md


<a id="org3b0e884"></a>

## Herramientas  para el particionado de episodios

Varios paquetes de [R empleados en el análisis de supervivencia](https://cran.r-project.org/web/views/Survival.html) tienen
funciones especificamente diseñadas para realizar el particionado de
los episodios en una dimesiónm temporal. Algunos de estas funciones
son, por ejemplom [survival::SurvSplit](https://www.rdocumentation.org/packages/survival/versions/3.1-8/topics/survSplit), [relsurv::survsplit](https://rdrr.io/cran/relsurv/man/survsplit.html) o
[Epi::splitLexis](https://www.rdocumentation.org/packages/Epi/versions/2.40/topics/splitLexis). Todas ellas hacen el particionado sobre una sola
escalan temporal, sin embargo aplicando sucesivamente estas funciones sobre
los sub-episodios resultado de ls partición con anterioridad, es posible
generar particiones en múltiples escalas temporales. Estas funciones
son sencillas de utilizar y eficientes cuando se trabaja con un número
no excesivamente grande de episodios y se dispone de suficientes
recursos de memoria RAM.

Desafortunadamente cuando el número de episodios que hay que
particionar crece, acercándose peligrosamente a los recurso de memoria
RAM del equipo, el rendimiento de estas funciones es pobre. Hay que
tener en cuenta que el crecimiento del número de episodio por encima
del óptimo, puede ocurrir incluso trabajando con tabla de episodios de
moderado tamaño, pero sobre las que precisemos realizar particionar en
múltiples escalas de tiempo (edades, tiempo calendario, duraciones
desde un episodio anterior &#x2026;)

El paquete **chopepi** que estamos desarrollando pretende mejora el
rendimiento de estos procesos, cuando no enfrentamos a tablas de
episodios de medio o gran tamaño. Para conseguir esta mejora aplicamos
dos estrategias: (1) por un lado usa objetos de tipo *data.table* para
procesar los episodios, más rápidamente y eficientemente que con las
habituales tablas del tipo data.frame; y por otro (2) los
particionados en una escala temporal son pre-tratado en forma de
listas en lugar de tabla de sup-episodios lo cual es más sencillo y
rapido de generar y menos oneroso en cuanto a uso de la memoria de
trabajo.

La primera estrategia, trabajar con objetos del tipo
*data.table*, resulta mucho mas eficiente, en lugar de los
tradicionales *data.frame* y sus derivados (Lexis, tibble &#x2026;), en
cuanto al uso de memoria RAM y velocidad de proceso, cuando se procesa
objeto de medio y gran tamaño. Si bien el uso del direccionamiento por
referencia de data.table crear algo de confusión en usuarios
poco habituados a trabajar con ello,  este inconvenientes es
rápidamente soluciónale, en cuanto se va adquiriendo cierta
experiencia en su manejo.

Esta misma estrategia de, usar *data.tabla* es empleada por el paquete
[popEpi](https://github.com/WetRobot/popEpi) para mejorar el rendimiento de procesar los objetos del tipo
[Lexis](https://rdrr.io/cran/Epi/man/Lexis.html) definidos que define el paquete [Epi de Bendix Carstensen](https://rdrr.io/cran/Epi/) como
data.frame clasicos.

La segunda estrategia que utiliza el paquete **chopepi** es generar el
particionado de las escalas temporales sobre una lista de vectores de
igual tamaño que el número de episodios a procesar. Esta estrategia
por un lado mejora significativamente la velocidad de particionado
uni-escal y además, en caso de tener que trabajar con particionados en
multiples escalas reduce la complejidad del problema, ya que el número de
episodios a procesar  no crece multiplicativamente, si no solo
linealmente con la inclusión de nuevas escalas. 

El objetivo final del particionado uni o multi-escala es construir una
nueva tabla de sub-episodios cuyo tamaño sera el resultado de
multiplicar el tamaño de la tabla original por el número de medio
sub-episodios que cada escala de partición genera, tal como se ha
mostrado anteriormente la tabla "[Split by age and period](#org241a805)". El paquete
**choopepi** divide el proceso de particionado en varios sub-procesos
intermedios que realizan cuatro funciones: *choop()*, *combine2()*,
*meltEpi()* y *addCXst()* y cuyos resultados intermedios se procesan
sucesivamente hasta obtener el resultado buscado.

Dado que una de las partes mas más costosos en memoria y tiempo de
proceso es la generación de multiples registros de subepisodios por
cada uno de los episodios originales partida, y su coste crece mas que
linealmente cuando aumenta el número de episodios, no es recomendable
obtener particionados multiescala a partir de la aplicación sucesivas,
de funciones del tipo *survSplit()*. Resulta menos oneroso en memoria
y tiempo de proceso realizar particiones unidimensionales
independientes de cada escala temporal para combinarlas
posteriormente. Este es una de las estrategia de optimización que usa
**chopepi** usar una combinación de funciones, en lugar de una única
función para conseguir su particionado.  La más importante de estas
funciones es **chop()**, la cual realiza un pre-particionado en una
escala subdivisión de la duración cada episodio sobre un vector con la
sucesión de tiempos de ocupación en cada categoría discreta de la
escala que estemos procesando (grupos de edad, años calendario ..), la
cual se almacenará en forma de lista de vectores en una columna una
tabla auxiliar con los resultados intermedios de la
pre-particionada. A modo de ejemplo, un pre-particionar en la escala
de edad de la [tabla de episodios original](#org088368b) produciría este resultado
intermedio:

<table id="orgd31a55c" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabla 5</span> Chop: duration by age</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">kid</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-left">durations.age</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">101</td>
<td class="org-right">0.000</td>
<td class="org-left">c(15, 5, 3.169)</td>
</tr>


<tr>
<td class="org-right">102</td>
<td class="org-right">23.169</td>
<td class="org-left">c(1.831, 1.804)</td>
</tr>


<tr>
<td class="org-right">201</td>
<td class="org-right">0.000</td>
<td class="org-left">c(15, 5, 1.079)</td>
</tr>


<tr>
<td class="org-right">202</td>
<td class="org-right">21.079</td>
<td class="org-left">c(3.921, 0.887)</td>
</tr>


<tr>
<td class="org-right">203</td>
<td class="org-right">25.887</td>
<td class="org-left">3.591</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">0.000</td>
<td class="org-left">c(15, 3.997)</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">18.997</td>
<td class="org-left">c(1.003, 4.838)</td>
</tr>
</tbody>
</table>

Esta tabla intermedia de episodios preparticionado se puede convertir
en una tabla de sub-episodios individuales, por medio de dos funciones
*chopepi::meltEpi* y *chopepi::addCXst*, que aplicadas secuencialmente
producen una tabla, donde cada sub-episodios es una fila, tal como se
muestra en la tabla anterior ["Split by age"](#orgd31a55c). Esta tabla podría volver
a sub-particionar aplicando de nuevo *chop()* sobre otra escala
temporal. Pero, como se ha comentado, para obtener un particionado en
múltiples escala, esta estrategia no es eficiente, ya que el primer
particionado multiplica los episodios originales por el número de
particiones por episodio de la segunda escala de tiempo empleada, lo
que puede incrementar su número lo suficiente para reducir
significativamente el rendimiento del segundo particionado. Resulta
más adecuado pre-particionar con *chop()* los episodios originales
sobre todas las escalas temporales a estudiar y tras ello combinar
estos en una nueva pre-partición multi-escala, a partir de la que
derivar posteriomente la tabla de subepisodios definitiva. Con esta
estrategia la complejidad del proceso crece linealmente por cada nueva
partición agregada en lugar de hacerlo multiplicativamete sin
aplicáramos el particionado secuencial.

Por ejemplo para conseguir una particionado múltiple en la escala edad
y calendario, aplicaremos *chop()* de nuevo sobre los episodios
originales para obtener este 2º preparticionado:

<table id="orgfdc45fd" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabla 6</span> Chop: duration by period</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">kid</th>
<th scope="col" class="org-right">period</th>
<th scope="col" class="org-left">durations.period</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">101</td>
<td class="org-right">1958.194</td>
<td class="org-left">c(16.806, 5, 1.363)</td>
</tr>


<tr>
<td class="org-right">102</td>
<td class="org-right">1981.364</td>
<td class="org-left">3.634</td>
</tr>


<tr>
<td class="org-right">201</td>
<td class="org-right">1955.520</td>
<td class="org-left">c(19.48, 1.599)</td>
</tr>


<tr>
<td class="org-right">202</td>
<td class="org-right">1976.598</td>
<td class="org-left">c(3.402, 1.405)</td>
</tr>


<tr>
<td class="org-right">203</td>
<td class="org-right">1981.408</td>
<td class="org-left">3.590</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">1960.161</td>
<td class="org-left">c(14.839, 4.158)</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">1979.158</td>
<td class="org-left">c(0.842, 4.999)</td>
</tr>
</tbody>
</table>

Para a continuación obtener el particionado en las dos escala de
tiempo combinamos los dos particionados unidimensionales en un nuevo
particionado multidimensional usando la función *combine2c* sobre las
tablas pre-particionadas: "[by age](#orgd31a55c)" y "[by period](#orgfdc45fd)", lo que producirá
el siguiente  resultado:

<table id="orgd753b96" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Tabla 7</span> Chop: duration by age and period</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">kid</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-right">period</th>
<th scope="col" class="org-left">durations.age.period</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">101</td>
<td class="org-right">0.000</td>
<td class="org-right">1958.194</td>
<td class="org-left">c(15, 1.8, 3.2, 1.8, 1.4)</td>
</tr>


<tr>
<td class="org-right">102</td>
<td class="org-right">23.169</td>
<td class="org-right">1981.364</td>
<td class="org-left">c(1.831, 1.8)</td>
</tr>


<tr>
<td class="org-right">201</td>
<td class="org-right">0.000</td>
<td class="org-right">1955.520</td>
<td class="org-left">c(15, 4.5, 0.5, 1.1)</td>
</tr>


<tr>
<td class="org-right">202</td>
<td class="org-right">21.079</td>
<td class="org-right">1976.598</td>
<td class="org-left">c(3.402, 0.5, 0.9)</td>
</tr>


<tr>
<td class="org-right">203</td>
<td class="org-right">25.887</td>
<td class="org-right">1981.408</td>
<td class="org-left">3.599</td>
</tr>


<tr>
<td class="org-right">301</td>
<td class="org-right">0.000</td>
<td class="org-right">1960.161</td>
<td class="org-left">c(14.839, 0.199, 4)</td>
</tr>


<tr>
<td class="org-right">302</td>
<td class="org-right">18.997</td>
<td class="org-right">1979.158</td>
<td class="org-left">c(0.842, 0.2, 4.8)</td>
</tr>
</tbody>
</table>

A partir de esta tabla de pre-particionado multidimensional, mediante
la posterior aplicación de las funciones *meltEpi()* y *addCXst()* se
optiene una tabla con registros individuales por cada sub-episodios,
como la mostrada individuales "[Split by age and period](#org241a805)" mostrada
anteriormente y que representa el objetivo finalmente buscado.
